# TP4 : Vers un r√©seau d'entreprise

# Sommaire

- [TP4 : Vers un r√©seau d'entreprise](#tp4--vers-un-r√©seau-dentreprise)
- [Sommaire](#sommaire)
- [I. Dumb switch](#i-dumb-switch)
  - [2. Adressage topologie 1](#2-adressage-topologie-1)
  - [3. Setup topologie 1](#3-setup-topologie-1)
- [II. VLAN](#ii-vlan)
  - [2. Adressage topologie 2](#2-adressage-topologie-2)
    - [3. Setup topologie 2](#3-setup-topologie-2)
- [III. Routing](#iii-routing)
  - [2. Adressage topologie 3](#2-adressage-topologie-3)
  - [3. Setup topologie 3](#3-setup-topologie-3)
- [IV. NAT](#iv-nat)
  - [1. Topologie 4](#1-topologie-4)
  - [2. Adressage topologie 4](#2-adressage-topologie-4)
  - [3. Setup topologie 4](#3-setup-topologie-4)

# I. Dumb switch

## 2. Adressage topologie 1

| Node  | IP            |
|-------|---------------|
| `pc1` | `10.1.1.1/24` |
| `pc2` | `10.1.1.2/24` |

## 3. Setup topologie 1

üåû **Commen√ßons simple**

- d√©finissez les IPs statiques sur les deux VPCS
```
PC1> ip 10.1.1.1/24
Checking for duplicate address...
PC1 : 10.1.1.1 255.255.255.0

PC1> show ip

NAME        : PC1[1]
IP/MASK     : 10.1.1.1/24
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:00
LPORT       : 10004
RHOST:PORT  : 127.0.0.1:10005
MTU:        : 1500

```
```
PC2> ip 10.1.1.2/24
Checking for duplicate address...
PC2 : 10.1.1.2 255.255.255.0

PC2> show ip

NAME        : PC2[1]
IP/MASK     : 10.1.1.2/24
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:01
LPORT       : 10002
RHOST:PORT  : 127.0.0.1:10003
MTU:        : 1500
```

- ping un VPCS depuis l'autre

```
PC1> ping 10.1.1.2
84 bytes from 10.1.1.2 icmp_seq=1 ttl=64 time=20.602 ms
84 bytes from 10.1.1.2 icmp_seq=2 ttl=64 time=14.539 ms
84 bytes from 10.1.1.2 icmp_seq=3 ttl=64 time=8.322 ms
84 bytes from 10.1.1.2 icmp_seq=4 ttl=64 time=16.085 ms
```

# II. VLAN

## 2. Adressage topologie 2

| Node  | IP            | VLAN |
|-------|---------------|------|
| `pc1` | `10.1.1.1/24` | 10   |
| `pc2` | `10.1.1.2/24` | 10   |
| `pc3` | `10.1.1.3/24` | 20   |

### 3. Setup topologie 2

üåû **Adressage**

- d√©finissez les IPs statiques sur tous les VPCS

```
PC3> ip 10.1.1.3/24
Checking for duplicate address...
PC3 : 10.1.1.3 255.255.255.0

PC3> show ip

NAME        : PC3[1]
IP/MASK     : 10.1.1.3/24
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:00
LPORT       : 20036
RHOST:PORT  : 127.0.0.1:20037
MTU         : 1500
```

- v√©rifiez avec des `ping` que tout le monde se ping

```
PC1> ping 10.1.1.2
84 bytes from 10.1.1.2 icmp_seq=1 ttl=64 time=16.112 ms
84 bytes from 10.1.1.2 icmp_seq=2 ttl=64 time=11.719 ms

PC1> ping 10.1.1.3
84 bytes from 10.1.1.3 icmp_seq=1 ttl=64 time=16.916 ms
84 bytes from 10.1.1.3 icmp_seq=2 ttl=64 time=14.431 ms
```

```
PC2> ping 10.1.1.1
84 bytes from 10.1.1.1 icmp_seq=1 ttl=64 time=12.376 ms
84 bytes from 10.1.1.1 icmp_seq=2 ttl=64 time=11.193 ms

PC2> ping 10.1.1.3
84 bytes from 10.1.1.3 icmp_seq=1 ttl=64 time=24.587 ms
84 bytes from 10.1.1.3 icmp_seq=2 ttl=64 time=6.280 ms
```

```
PC3> ping 10.1.1.1
84 bytes from 10.1.1.1 icmp_seq=1 ttl=64 time=7.422 ms
84 bytes from 10.1.1.1 icmp_seq=2 ttl=64 time=27.938 ms


PC3> ping 10.1.1.2
84 bytes from 10.1.1.2 icmp_seq=1 ttl=64 time=19.797 ms
84 bytes from 10.1.1.2 icmp_seq=2 ttl=64 time=29.138 ms
```

üåû **Configuration des VLANs**

- d√©claration des VLANs sur le switch `sw1`

```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10
Switch(config-vlan)#name admins
Switch(config-vlan)#exit
```
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10
Switch(config-vlan)#name admins
Switch(config-vlan)#exit
```
```
Switch(config)#vlan 20
Switch(config-vlan)#name guests
Switch(config-vlan)#exit
```
```
Switch(config)#exit
Switch#show vlan
[...]
VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Gi0/0, Gi0/1, Gi0/2, Gi0/3
                                                Gi1/0, Gi1/1, Gi1/2, Gi1/3
                                                Gi2/0, Gi2/1, Gi2/2, Gi2/3
                                                Gi3/0, Gi3/1, Gi3/2, Gi3/3
10   admins                           active
20   guests                           active
[...]
```

- ajout des ports du switches dans le bon VLAN (voir [le tableau d'adressage de la topo 2 juste au dessus](#2-adressage-topologie-2))
  - ici, tous les ports sont en mode *access* : ils pointent vers des clients du r√©seau

```
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface Gi0/0
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 10
```
```
Switch(config)#interface Gi0/1
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 10
```
```
Switch(config-if)#interface Gi0/2
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 20
```
```
Switch#show vlan br

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Gi0/3, Gi1/0, Gi1/1, Gi1/2
                                                Gi1/3, Gi2/0, Gi2/1, Gi2/2
                                                Gi2/3, Gi3/0, Gi3/1, Gi3/2
                                                Gi3/3
10   admins                           active    Gi0/0, Gi0/1
20   guests                           active    Gi0/2
[...]
```

üåû **V√©rif**

- `pc1` et `pc2` doivent toujours pouvoir se ping

```
PC1> ping 10.1.1.2

84 bytes from 10.1.1.2 icmp_seq=1 ttl=64 time=23.133 ms
84 bytes from 10.1.1.2 icmp_seq=2 ttl=64 time=12.464 ms

PC2> ping 10.1.1.1

84 bytes from 10.1.1.1 icmp_seq=1 ttl=64 time=8.912 ms
84 bytes from 10.1.1.1 icmp_seq=2 ttl=64 time=27.204 ms
```

- `pc3` ne ping plus personne

```
PC3> ping 10.1.1.1

host (10.1.1.1) not reachable

PC3> ping 10.1.1.2

host (10.1.1.2) not reachable
```
# III. Routing

## 2. Adressage topologie 3

Les r√©seaux et leurs VLANs associ√©s :

| R√©seau    | Adresse       | VLAN associ√© |
|-----------|---------------|--------------|
| `clients` | `10.1.1.0/24` | 11           |
| `servers` | `10.2.2.0/24` | 12           |
| `routers` | `10.3.3.0/24` | 13           |

L'adresse des machines au sein de ces r√©seaux :

| Node               | `clients`       | `admins`        | `servers`       |
|--------------------|-----------------|-----------------|-----------------|
| `pc1.clients.tp4`  | `10.1.1.1/24`   | x               | x               |
| `pc2.clients.tp4`  | `10.1.1.2/24`   | x               | x               |
| `adm1.admins.tp4`  | x               | `10.2.2.1/24`   | x               |
| `web1.servers.tp4` | x               | x               | `10.3.3.1/24`   |
| `r1`               | `10.1.1.254/24` | `10.2.2.254/24` | `10.3.3.254/24` |

## 3. Setup topologie 3

üñ•Ô∏è VM `web1.servers.tp4`, d√©roulez la [Checklist VM Linux](#checklist-vm-linux) dessus

üåû **Adressage**

- d√©finissez les IPs statiques sur toutes les machines **sauf le *routeur***

üåû **Configuration des VLANs**

- r√©f√©rez-vous au [m√©mo Cisco](../../cours/memo/memo_cisco.md#8-vlan)
- d√©claration des VLANs sur le switch `sw1`
- ajout des ports du switches dans le bon VLAN (voir [le tableau d'adressage de la topo 2 juste au dessus](#2-adressage-topologie-2))
- il faudra ajouter le port qui pointe vers le *routeur* comme un *trunk* : c'est un port entre deux √©quipements r√©seau (un *switch* et un *routeur*)

---

‚ûú **Pour le *routeur***

- r√©f√©rez-vous au [m√©mo Cisco](../../cours/memo/memo_cisco.md)
- ici, on va avoir besoin d'un truc tr√®s courant pour un *routeur* : qu'il porte plusieurs IP sur une unique interface
  - avec Cisco, on cr√©e des "sous-interfaces" sur une interface
  - et on attribue une IP √† chacune de ces sous-interfaces
- en plus de √ßa, il faudra l'informer que, pour chaque interface, elle doit √™tre dans un VLAN sp√©cifique

Pour ce faire, un exemple. On attribue deux IPs `192.168.1.254/24` VLAN 11 et `192.168.2.254` VLAN12 √† un *routeur*. L'interface concern√©e sur le *routeur* est `fastEthernet 0/0` :

```cisco
# conf t

(config)# interface fastEthernet 0/0.10
R1(config-subif)# encapsulation dot1Q 10
R1(config-subif)# ip addr 192.168.1.254 255.255.255.0 
R1(config-subif)# exit

(config)# interface fastEthernet 0/0.20
R1(config-subif)# encapsulation dot1Q 20
R1(config-subif)# ip addr 192.168.2.254 255.255.255.0 
R1(config-subif)# exit
```

üåû **Config du *routeur***

- attribuez ses IPs au *routeur*
  - 3 sous-interfaces, chacune avec son IP et un VLAN associ√©

üåû **V√©rif**

- tout le monde doit pouvoir ping le routeur sur l'IP qui est dans son r√©seau
- en ajoutant une route vers les r√©seaux, ils peuvent se ping entre eux
  - ajoutez une route par d√©faut sur les VPCS
  - ajoutez une route par d√©faut sur la machine virtuelle
  - testez des `ping` entre les r√©seaux

# IV. NAT

On va ajouter une fonctionnalit√© au routeur : le NAT.

On va le connecter √† internet (simulation du fait d'avoir une IP publique) et il va faire du NAT pour permettre √† toutes les machines du r√©seau d'avoir un acc√®s internet.

![Yellow cable](./pics/yellow-cable.png)

## 1. Topologie 4

![Topologie 3](./pics/topo4.png)

## 2. Adressage topologie 4

Les r√©seaux et leurs VLANs associ√©s :

| R√©seau    | Adresse       | VLAN associ√© |
|-----------|---------------|--------------|
| `clients` | `10.1.1.0/24` | 11           |
| `servers` | `10.2.2.0/24` | 12           |
| `routers` | `10.3.3.0/24` | 13           |

L'adresse des machines au sein de ces r√©seaux :

| Node               | `clients`       | `admins`        | `servers`       |
|--------------------|-----------------|-----------------|-----------------|
| `pc1.clients.tp4`  | `10.1.1.1/24`   | x               | x               |
| `pc2.clients.tp4`  | `10.1.1.2/24`   | x               | x               |
| `adm1.admins.tp4`  | x               | `10.2.2.1/24`   | x               |
| `web1.servers.tp4` | x               | x               | `10.3.3.1/24`   |
| `r1`               | `10.1.1.254/24` | `10.2.2.254/24` | `10.3.3.254/24` |

## 3. Setup topologie 4

üåû **Ajoutez le noeud Cloud √† la topo**

- branchez √† `eth1` c√¥t√© Cloud
- c√¥t√© routeur, il faudra r√©cup√©rer un IP en DHCP (voir [le m√©mo Cisco](../../cours/memo/memo_cisco.md))
- vous devriez pouvoir `ping 1.1.1.1`

üåû **Configurez le NAT**

- r√©f√©rez-vous [√† la section NAT du m√©mo Cisco](../../cours/memo/memo_cisco.md#7-configuration-dun-nat-simple)

üåû **Test**

- ajoutez une route par d√©faut (si c'est pas d√©j√† fait)
  - sur les VPCS
  - sur la machine Linux
- configurez l'utilisation d'un DNS
  - sur les VPCS
  - sur la machine Linux
- v√©rifiez un `ping` vers un nom de domaine

# V. Add a building

On a achet√© un nouveau b√¢timent, faut tirer et configurer un nouveau switch jusque l√†-bas.

On va en profiter pour setup un serveur DHCP pour les clients qui s'y trouvent.

## 1. Topologie 5

![Topo 5](./pics/topo5.png)

## 2. Adressage topologie 5

Les r√©seaux et leurs VLANs associ√©s :

| R√©seau    | Adresse       | VLAN associ√© |
|-----------|---------------|--------------|
| `clients` | `10.1.1.0/24` | 11           |
| `servers` | `10.2.2.0/24` | 12           |
| `routers` | `10.3.3.0/24` | 13           |

L'adresse des machines au sein de ces r√©seaux :

| Node                | `clients`       | `admins`        | `servers`       |
|---------------------|-----------------|-----------------|-----------------|
| `pc1.clients.tp4`   | `10.1.1.1/24`   | x               | x               |
| `pc2.clients.tp4`   | `10.1.1.2/24`   | x               | x               |
| `pc3.clients.tp4`   | DHCP            | x               | x               |
| `pc4.clients.tp4`   | DHCP            | x               | x               |
| `pc5.clients.tp4`   | DHCP            | x               | x               |
| `dhcp1.clients.tp4` | `10.1.1.253/24` | x               | x               |
| `adm1.admins.tp4`   | x               | `10.2.2.1/24`   | x               |
| `web1.servers.tp4`  | x               | x               | `10.3.3.1/24`   |
| `r1`                | `10.1.1.254/24` | `10.2.2.254/24` | `10.3.3.254/24` |

## 3. Setup topologie 5

Vous pouvez partir de la topologie 4. 

üåû  **Vous devez me rendre le `show running-config` de tous les √©quipements**

- de tous les √©quipements r√©seau
  - le routeur
  - les 3 switches

> N'oubliez pas les VLANs sur tous les switches.

üñ•Ô∏è **VM `dhcp1.client1.tp4`**, d√©roulez la [Checklist VM Linux](#checklist-vm-linux) dessus

üåû  **Mettre en place un serveur DHCP dans le nouveau b√¢timent**

- il doit distribuer des IPs aux clients dans le r√©seau `clients` qui sont branch√©s au m√™me switch que lui
- sans aucune action manuelle, les clients doivent...
  - avoir une IP dans le r√©seau `clients`
  - avoir un acc√®s au r√©seau `servers`
  - avoir un acc√®s WAN
  - avoir de la r√©solution DNS

> R√©utiliser les serveurs DHCP qu'on a mont√© dans les autres TPs.

üåû  **V√©rification**

- un client r√©cup√®re une IP en DHCP
- il peut ping le serveur Web
- il peut ping `8.8.8.8`
- il peut ping `google.com`

> Faites √ßa sur n'importe quel VPCS que vous venez d'ajouter : `pc3` ou `pc4` ou `pc5`.

![i know cisco](./pics/i_know.jpeg)
